index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="description" content="My blog site">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Carlos Perez</title>
<link href="assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" href="rss.xml">
<link rel="canonical" href="https://example.com/">
<!--[if lt IE 9]><![endif]--><link rel="prefetch" href="posts/blogging-with-nikola-and-orgmode/" type="text/html">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Menubar -->

<nav class="navbar navbar-inverse navbar-static-top"><div class="container">
<!-- This keeps the margins nice -->
        <div class="navbar-header">
            <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#bs-navbar" aria-controls="bs-navbar" aria-expanded="false">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="https://example.com/">

                <span id="blog-title">Carlos Perez</span>
            </a>
        </div>
<!-- /.navbar-header -->
        <div class="collapse navbar-collapse" id="bs-navbar" aria-expanded="false">
            <ul class="nav navbar-nav">
<li>
<a href="archive.html">Archive</a>
                </li>
<li>
<a href="categories/">Tags</a>
                </li>
<li>
<a href="rss.xml">RSS feed</a>

                
            </li>
</ul>
<ul class="nav navbar-nav navbar-right"></ul>
</div>
<!-- /.navbar-collapse -->
    </div>
<!-- /.container -->
</nav><!-- End of Menubar --><div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        <div class="row">
            
            

    


    
<div class="postindex">
    <article class="h-entry post-text"><header><h1 class="p-name entry-title"><a href="posts/blogging-with-nikola-and-orgmode/" class="u-url">Blogging with Nikola and Orgmode</a></h1>
        <div class="metadata">
            <p class="byline author vcard"><span class="byline-name fn" itemprop="author">
                Carlos Perez
            </span></p>
            <p class="dateline"><a href="posts/blogging-with-nikola-and-orgmode/" rel="bookmark"><time class="published dt-published" datetime="2017-10-21T15:13:33+05:00" title="2017-10-21 15:13">2017-10-21 15:13</time></a></p>
        </div>
    </header><div class="e-content entry-content">
    <p>
After some time in the darkness, I have finally managed to set up a blog and
write my first "serious" entry.
</p>

<p>
I think it makes complete sense to star from the beginning, it means, by
showing what I did to get this blog going. I do this mainly for myself, to make
me organize my thoughts and filter all the resources I have used. But I will be
really happy if it also is clear enough for someone to follow along and start
blogging by themselves.
</p>

<p>
This is not the conventional blogging system used by other sites like Wordpress
or blogger and although it is not extremely difficult to use, it does require
some skills.
</p>

<p>
So, no more words, and let's get started.
</p>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Static website</h2>
<div class="outline-text-2" id="text-1">
<p>
I have not had any previous experience with blogging and I have never been
attracted by using platforms like WordPress, as it has a lot of features that
you do not really use or control, it requires you to create an account and your
posts need to be written in their platform, so once you do it, you do not
really have access to them. But once I knew about the possibilities of using
static content blog, I decided it was worth trying. Some of them are:
</p>
<ul class="org-ul">
<li>Easy to use and update
</li>
<li>Possibility of hosting in Github Pages
</li>
<li>Your posts are saved as text files
</li>
<li>You look like a pro. :p
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">What do you need to get going?</h2>
<div class="outline-text-2" id="text-2">
<p>
There are countless ways to blog using a static site. Hereby I provide my
current way of working with the following:
</p>

<ul class="org-ul">
<li>Nikola: a static site generator based on Python.
</li>
<li>Org mode: probably the most powerful text editor.
</li>
</ul>
<p>
I will try to separate them and mainly focus in a general
installation. I will probably restructure my this blog entry once I have more
content written.
</p>

<p>
Saying that, you will definitely need the following:
</p>
<ul class="org-ul">
<li>Python: Use a recent version. For this tutorial, I assume it is obtained with
the Anaconda distribution.
</li>
<li>Github: A platform for hosting coding projects using the git versioning
system. It is used to host the blog with a feature called github pages
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Basic installation</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">Create a Conda environment</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Once you have your python installation ready, it is time to install Nikola,
which can be installed as any other python library.
It is advisable to use an isolated environment to better handling dependencies.
There are mainly two ways of doing it: creating a python virtual environment or
using conda environments. I chose the latter as it is the one I am more
familiar with.
</p>

<div class="highlight"><pre><span></span>conda create --name nikola pip
</pre></div>

<p>
To make sure the environment is initialized
</p>

<div class="highlight"><pre><span></span>source activate nikola
</pre></div>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2">Initialization</h3>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3">Theme customization</h3>
<div class="outline-text-3" id="text-3-3">
<p>
The default theme is bootstrap3. You have the option to further customize it by
using bootswatch options
</p>

<p>
For example, if you want to use the Readable theme, use the following command
</p>

<div class="highlight"><pre><span></span>nikola bootswatch_theme -n readable -s readable
</pre></div>

<p>
Now, set the theme to "readable" in in the <code>conf.py</code> file
</p>

<div class="highlight"><pre><span></span><span class="n">THEME</span> <span class="o">=</span> <span class="s1">'readable'</span>
</pre></div>
</div>
</div>
</div>
    </div>
    </article>
</div>







        </div>
        <!--End of body content-->

        <footer id="footer">
            Contents © 2017         <a href="mailto:carlosperezmolano@gmail.com">Carlos Perez</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
        </footer>
</div>
</div>


            <script src="assets/js/all-nocdn.js"></script><script>$('a.image-reference:not(.islink) img:not(.islink)').parent().colorbox({rel:"gal",maxWidth:"100%",maxHeight:"100%",scalePhotos:true});</script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates -->
</body>
</html>
